{"summary":{"types":["Water"],"species":"Fish Pokémon","height":"2′11″ (0.89m)","weight":"22 lbs (10.0 kg)","abilities":["Swift Swim","Rattled"]},"training":{"EV yield":"1 Speed","Catch rate":"255 (33.3% with PokéBall, full HP)","Base Happiness":"70 (normal)","Base EXP":"20","Growth Rate":"Slow"},"breeding":{"Egg Groups":"Dragon, Water 2","Gender":"50% male, 50% female","Egg cycles":"5(base 1,280 steps)"},"stats":{"HP":{"base":"20","min":"150","max":"244"},"Attack":{"base":"10","min":"22","max":"130"},"Defense":{"base":"55","min":"103","max":"229"},"Sp. Atk":{"base":"15","min":"31","max":"141"},"Sp. Def":{"base":"20","min":"40","max":"152"},"Speed":{"base":"80","min":"148","max":"284"}},"entry":{"RedBlue":"In the distant past, it was somewhat stronger than the horribly weak descendants that exist today.","Yellow":"Famous for being very unreliable. It can be found swimming in seas, lakes, rivers and shallow puddles.","Gold":"An underpowered, pathetic POKéMON. It may jump high on rare occasions, but never more than seven feet.","Silver":"For no reason, it jumps and splashes about, making it easy for predators like PIDGEOTTO to catch it mid-jump.","Crystal":"This weak and pathetic POKéMON gets easily pushed along rivers when there are strong currents.","Ruby":"MAGIKARP is a pathetic excuse for a POKéMON that is only capable of flopping and splashing. This behavior prompted scientists to undertake research into it.","Sapphire":"MAGIKARP is virtually useless in battle as it can only splash around. As a result, it is considered to be weak. However, it is actually a very hardy POKéMON that can survive in any body of water no matter how polluted it is.","FireRed":"It is virtually worthless in terms of both power and speed. It is the most weak and pathetic POKéMON in the world.","LeafGreen":"In the distant past, it was somewhat stronger than the horribly weak descendants that exist today.","Emerald":"Its swimming muscles are weak, so it is easily washed away by currents. In places where water pools, you can see many MAGIKARP deposited there by the flow.","Diamond":"It is said to be the world’s weakest Pokémon. No one knows why it has managed to survive.","Pearl":"It is unable to swim against even slow-moving currents. It always splashes about for some reason.","Platinum":"A MAGIKARP living for many years can leap a mountain using Splash. The move remains useless, though.","HeartGold":"An underpowered, pathetic Pokémon. It may jump high on rare occasions, but usually not more than seven feet.","SoulSilver":"For no reason, it jumps and splashes about, making it easy for predators like PIDGEOTTO to catch it mid-jump.","BlackWhiteBlack 2White 2":"A Magikarp living for many years can leap a mountain using Splash. The move remains useless, though.","X":"It is virtually worthless in terms of both power and speed. It is the most weak and pathetic Pokémon in the world.","Y":"In the distant past, it was somewhat stronger than the horribly weak descendants that exist today.","Omega Ruby":"Magikarp is a pathetic excuse for a Pokémon that is only capable of flopping and splashing. This behavior prompted scientists to undertake research into it.","Alpha Sapphire":"Magikarp is virtually useless in battle as it can only splash around. As a result, it is considered to be weak. However, it is actually a very hardy Pokémon that can survive in any body of water no matter how polluted it is.","Sun":"Although weak and helpless, this Pokémon is incredibly fertile. They exist in such multitudes, you’ll soon grow tired of seeing them.","Moon":"Its reckless leaps make it easy pickings for predators. On the bright side, many Pokémon enjoy longer life spans, thanks to Magikarp."},"moves":{"byLevelUp":[{"Level":"1","Name":"Splash","Type":"Normal","Category":"status","Power":"—","Accuracy":"—"},{"Level":"15","Name":"Tackle","Type":"Normal","Category":"physical","Power":"40","Accuracy":"100"},{"Level":"30","Name":"Flail","Type":"Normal","Category":"physical","Power":"—","Accuracy":"100"}],"byEgg":[],"byTutor":[{"Name":"Bounce","Type":"Flying","Category":"physical","Power":"85","Accuracy":"85"}],"byTM":[]},"location":{"RedBlueYellow":["Route 4, 6, 10, 11, 12, 13, 17, 18, 19, 20, 21, 22, 23, 24, 25, Celadon City, Pallet Town"],"GoldSilver":["Route 6, 9, 10, 12, 13, 19, 20, 21, 22, 24, 25, 26, 27, 28, 30, 31, 32, 34, 35, 40, 41, 42, 43, 44, 45, Blackthorn City, Cerulean City, Cherrygrove City, Cianwood City, Cinnabar Island, Dark Cave, Dragon's Den, Ecruteak City, Fuchsia City, Ilex Forest, Lake of Rage, Mt. Silver, New Bark Town, Olivine City, Pallet Town, Ruins of Alph, Slowpoke Well, Union Cave, Vermilion City, Violet City, Viridian City, Whirl Islands"],"Crystal":["Route 6, 9, 10, 12, 13, 19, 20, 21, 22, 24, 25, 26, 27, 28, 30, 31, 32, 34, 35, 40, 41, 42, 43, 44, 45, Cherrygrove City, Cinnabar Island, Dragon's Den, Ilex Forest, Lake of Rage, New Bark Town, Pallet Town"],"Ruby":["Route 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 114, 115, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, Abandoned Ship, Dewford Town, Ever Grande City, Meteor Falls, Mossdeep City, Pacifidlog Town, Petalburg City, Safari Zone, Seafloor Cavern, Shoal Cave, Slateport City, Sootopolis City"],"Sapphire":["Route 102, 103, 104, 105, 107, 108, 109, 110, 111, 114, 115, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, Abandoned Ship, Dewford Town, Ever Grande City, Meteor Falls, Mossdeep City, Pacifidlog Town, Petalburg City, Safari Zone, Seafloor Cavern, Shoal Cave, Slateport City, Sootopolis City"],"FireRedLeafGreen":["Route 4, 6, 10, 11, 12, 13, 19, 20, 21, 22, 23, 24, 25, Berry Forest, Bond Bridge, Cape Brink, Celadon City, Cerulean Cave, Cerulean City, Cinnabar Island, Five Island, Five Isle Meadow, Four Island, Fuchsia City, Green Path, Icefall Cave, Kindle Road, Memorial Pillar, One Island, Outcast Island, Pallet Town, Resort Gorgeous, Ruin Valley, Seafoam Islands, Tanoby Ruins, Trainer Tower, Treasure Beach, Vermilion City, Viridian City, Water Labyrinth, Water Path"],"Emerald":["Route 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 114, 115, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, Abandoned Ship, Dewford Town, Ever Grande City, Meteor Falls, Mossdeep City, Pacifidlog Town, Petalburg City, Safari Zone, Seafloor Cavern, Shoal Cave, Slateport City, Sootopolis City"],"DiamondPearl":["Route 203, 204, 205, 208, 209, 210, 212, 213, 214, 218, 219, 220, 221, 222, 223, 224, 225, 226, 227, 228, 229, 230, Canalave City, Celestic Town, Eterna City, Fuego Ironworks, Great Marsh, Iron Island, Lake Acuity, Lake Valor, Lake Verity, Mt. Coronet, Oreburgh Gate, Pastoria City, Pokemon League, Ravaged Path, Resort Area, Sendoff Spring, Sunyshore City, Twinleaf Town, Valley Windworks, Victory Road"],"Platinum":["Route 202, 203, 204, 205, 208, 209, 210, 212, 213, 214, 218, 219, 220, 221, 222, 223, 224, 225, 226, 227, 228, 229, 230, Canalave City, Celestic Town, Eterna City, Fuego Ironworks, Great Marsh, Iron Island, Lake Acuity, Lake Valor, Lake Verity, Mt. Coronet, Oreburgh Gate, Pastoria City, Pokemon League, Ravaged Path, Resort Area, Sendoff Spring, Sunyshore City, Twinleaf Town, Valley Windworks, Victory Road"],"HeartGoldSoulSilver":["Route 6, 9, 10, 12, 13, 20, 21, 22, 24, 25, 26, 27, 28, 30, 31, 32, 35, 41, 42, 43, 44, 45, 47, Blackthorn City, Cerulean Cave, Cerulean City, Cinnabar Island, Cliff Edge Gate, Dark Cave, Dragon's Den, Ecruteak City, Fuchsia City, Ilex Forest, Lake of Rage, Mt. Moon, Mt. Mortar, Mt. Silver, New Bark Town, Pallet Town, Ruins of Alph, Seafoam Islands, Slowpoke Well, Tohjo Falls, Union Cave, Vermilion City, Violet City, Viridian City, Whirl Islands"],"BlackWhite":["Marvelous Bridge"],"Black 2White 2":["Nature Sanctuary, Nature Preserve"],"XY":["Route 3, 22, Parfum Palace"],"Omega RubyAlpha Sapphire":["Route 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 114, 115, 117, 118, 119, 120, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, Dewford Town, Ever Grande City, Meteor Falls, Mossdeep City, Pacifidlog Town, Petalburg City, Safari Zone, Scorched Slab, Seafloor Cavern, Sealed Chamber, Shoal Cave, Slateport City, Sootopolis City, Lilycove City, Victory Road, Battle Resort, Sea Mauville, Team Magma/Aqua Hideout"],"SunMoon":["Route 7, 8, 9, 13, 14, 15, Melemele Sea, Kala'e Bay, Seaward Cave, Paniola Town, Brooklet Hill, Secluded Shore, Tapu Village, Malie Garden, Poni Wilds, Poni Breaker Coast, Poni Gauntlet, Seafolk Village, Poni Meadow, Vast Poni Canyon"]},"imageUrl":"https://img.pokemondb.net/artwork/magikarp.jpg"}